app/views/manager/affiliazioni.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
                    <%if affiliazione.manager.to_i==current_user.id && affiliazione.status!="accepted" && affiliazione.azienda==""%>
                        <% @cliente= User.find(affiliazione.cliente)%>