app/views/manager/aziende.html.erb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."azienda" = ? AND "affiliations"."cliente" = ? AND "affiliations"."manager" = ? LIMIT ?  [["azienda", "9"], ["cliente", "8"], ["manager", "7"], ["LIMIT", 1]]
---

                        <%affiliation= Affiliation.where(azienda: azienda).where(cliente: @cliente.to_s).where(manager: @manager).take%>