app/views/manager/events.html.erb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."cliente" = ? AND "affiliations"."manager" = ? AND "affiliations"."status" = ? LIMIT ?  [["cliente", "6"], ["manager", "5"], ["status", "accepted"], ["LIMIT", 1]]
---

                <% @affiliazione=Affiliation.where(cliente: @cliente.id.to_s).where(manager: current_user.id.to_s).where(status: "accepted").take%>