app/views/manager/index.html.erb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."cliente" = ? AND "affiliations"."manager" = ? AND "affiliations"."status" = ? LIMIT ?  [["cliente", "1"], ["manager", "5"], ["status", "accepted"], ["LIMIT", 1]]
---
                <% @users.each do |user| %>
                    <% @affiliazione=Affiliation.where(cliente: user.id.to_s).where(manager: current_user.id.to_s).where(status: "accepted").take%>