app/views/cliente/function.html.erb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."cliente" = ? AND "affiliations"."status" = ? LIMIT ?  [["cliente", "12"], ["status", "accepted"], ["LIMIT", 1]]
---

                <% affilRecord = Affiliation.find_by(cliente: current_user.id, status: "accepted")%>

SELECT "calendars".* FROM "calendars" WHERE "calendars"."userId" = ? AND "calendars"."managerId" = ? LIMIT ?  [["userId", "12"], ["managerId", "7"], ["LIMIT", 1]]
---

                    <%if !Calendar.where(userId: current_user.id.to_s).where(managerId: managerID).take%>