app/views/cliente/search.html.erb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."cliente" = ? AND "affiliations"."manager" = ? LIMIT ?  [["cliente", "10"], ["manager", "3"], ["LIMIT", 1]]
---

                        <%if Affiliation.where(cliente: current_user.id).where(manager: user.id).take%>