app/views/cliente/visualize.html.erb

              <div class="d-flex justify-content-center m-4">
                <% affiliation= Affiliation.where(cliente: current_user.id).where(manager: @profilato.id).take%>
---
SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."cliente" = ? AND "affiliations"."manager" = ? LIMIT ?  [["cliente", "1"], ["manager", "3"], ["LIMIT", 1]]

                <% else%>
                  <% if !Affiliation.where(cliente:current_user.id).take%>
---
SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."cliente" = ? LIMIT ?  [["cliente", "8"], ["LIMIT", 1]]