app/views/affiliations/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
        <div class="card-body text-center">
          <% if !User.find(@azienda.to_i).avatar.attached?%>
            <img src="<%=withoutLast5(User.find(@azienda.to_i).avatar_url)%>" alt="avatar"

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
          <%end%>
          <h5 class="my-3 text-capitalize"><%= User.find(@azienda.to_i).full_name %></h5>
          <p class="text-muted text-capitalize"><%= User.find(@azienda.to_i).ruolo %></p>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---

        <% if !User.find(@manager.to_i).avatar.attached?%>
          <img src="<%=withoutLast5(User.find(@manager.to_i).avatar_url)%>" alt="avatar"

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---

        <h5 class="my-3 text-capitalize"><%= User.find(@manager.to_i).full_name %></h5>
        <p class="text-muted text-capitalize"><%= User.find(@manager.to_i).ruolo %></p>