app/controllers/affiliations_controller.rb

  def create
    @affiliation = Affiliation.new(affiliation_params)
    @cliente= affiliation_params[:cliente]
    @manager= affiliation_params[:manager]
    @azienda= affiliation_params[:azienda]
    respond_to do |format|
      if @affiliation.save
---
INSERT INTO "affiliations" ("cliente", "manager", "status", "created_at", "updated_at", "azienda") VALUES (?, ?, ?, ?, ?, ?)  [["cliente", "1"], ["manager", "3"], ["status", "pending"], ["created_at", "2022-10-30 21:14:24.142385"], ["updated_at", "2022-10-30 21:14:24.142385"], ["azienda", ""]]

    def set_affiliation
      @affiliation = Affiliation.find(params[:id])
      @affiliation.update_attribute(:status, "accepted")
---
SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "affiliations" SET "status" = ?, "updated_at" = ? WHERE "affiliations"."id" = ?  [["status", "accepted"], ["updated_at", "2022-10-31 10:06:05.452117"], ["id", 3]]