app/controllers/application_controller.rb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."manager" = ? AND "affiliations"."cliente" = ? AND "affiliations"."status" = ? LIMIT ?  [["manager", "5"], ["cliente", "6"], ["status", "accepted"], ["LIMIT", 1]]
---
    def is_it_your_client(manager,cliente)
        if !Affiliation.where(manager: manager).where(cliente: cliente).where(status: 'accepted').take