app/controllers/calendar_controller.rb

    def create
        userID = params[:userID]
        cliente = User.find(userID)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def createEventConfirm
        event = params[:event]
        userID = event[:userID]

        client = get_google_calendar_client current_user

        # Controlla la scelta di creazione della conferenza meet dal form
        if event[:meetConference]
            conferenceData = {
                create_request: {
                   request_id: SecureRandom.uuid
                }
            }
        else
            conferenceData = nil
        end

        attendeeRecord = User.find_by(id: userID)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]