app/controllers/calendar_controller.rb

SELECT 1 AS one FROM "calendars" WHERE "calendars"."hash" = ? LIMIT ?  [["hash", "78490951325567271"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "access_token" = ? WHERE "users"."id" = ?
INSERT INTO "calendars" ("calendarId", "summary", "userId", "managerId", "hash", "acl_id") VALUES (?, ?, ?, ?, ?, ?)
---
    def create

        # Da testare
        userID = params[:userID]

        client = get_google_calendar_client current_user
        calendarList = client.list_calendar_lists()

        hash = makeHash(current_user.id, userID)

        calendarList.items.each do |calendar|
            # Da Cambiare e ricercare per userID e managerID
            if calendar.summary === "MMY_USER_#{hash}"
                # CONTROLLARE SE calendarID sono uguali

                if !Calendar.exists?(:hash => hash)
                    foundCalendar = Calendar.where(:hash => hash)

                    #CONTROLLARE QUI SE ENTRAMBI SONO COLLEGATI A OAUTH ALTRIMENTI REINDIRIZZARLI

                    aclCalendarList = client.lists_acls(foundCalendar.calendarId)
                    acl = aclCalendarList.items.first

                    calendarToSave = newCalendar(calendar, userID, hash, acl.id)

                    # Sistemare, salva ma da errore
                    calendarToSave.save!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
        createdCalendar = client.insert_calendar(googleCalendar)

        # Inserisco l'utente nelle ACL del calendario appena creato
        user = User.find(userID)

INSERT INTO "calendars" ("calendarId", "summary", "userId", "managerId", "hash", "acl_id") VALUES (?, ?, ?, ?, ?, ?)
---
            role: "writer"
        )
        # Google API Method per inserire le ACL appena create al Google Calendar
        result = client.insert_acl(createdCalendar.id, rule)

INSERT INTO "calendars" ("calendarId", "summary", "userId", "managerId", "hash", "acl_id") VALUES (?, ?, ?, ?, ?, ?)
---
        # Aggiungo il Calendar appena creato al DB Calendars
        calendarToSave = newCalendar(createdCalendar, userID, hash, result.id)
        # Da sistemare, salva ma da errore di conversione
        calendarToSave.save!

UPDATE "users" SET "updated_at" = ?, "access_token" = ? WHERE "users"."id" = ?
---
        client.authorization.grant_type = "refresh_token"

        client.authorization.refresh!
        current_user.update_attribute(:access_token, client.authorization.access_token)

SELECT "calendars".* FROM "calendars" WHERE "calendars"."managerId" = ? AND "calendars"."userId" = ? LIMIT ?  [["managerId", "5"], ["userId", "6"], ["LIMIT", 1]]
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 1]]
---
    def delete
        userID = params[:userID]

        client = get_google_calendar_client current_user
        calendar = Calendar.find_by(managerId: current_user.id, userId: userID)

        if calendar
            client.delete_acl(calendar.calendarId, calendar.acl_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def createEventConfirm
        event = params[:event]
        userID = event[:userID]

        # Da sistemare con tutti i dati
        # @newEvent = Event.new()
        # @newEvent.summary = event[:summary]
        # @newEvent.save

        # Controlla la scelta di creazione della conferenza meet dal form
        if event[:meetConference]
            conferenceData = {
                create_request: {
                   request_id: SecureRandom.uuid
                }
            }
        else
            conferenceData = nil
        end

        attendeeRecord = User.find_by(id: userID)

SELECT "calendars".* FROM "calendars" WHERE "calendars"."managerId" = ? AND "calendars"."userId" = ? LIMIT ?  [["managerId", "7"], ["userId", "10"], ["LIMIT", 1]]
---
        )

        if current_user.ruolo === "manager"
            calendar = Calendar.find_by(managerId: current_user.id, userId: event[:userID])
        else
            calendar = Calendar.find_by(managerId: event[:userID], userId: current_user.id)

INSERT INTO "events" ("summary", "description", "start", "end", "calendarID", "eventID", "clientID", "managerID", "created_at", "updated_at", "meetCode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        # client.client_options.application_name = APPLICATION_NAME
        # client.authorization = authorize

        @createdEvent = client.insert_event(calendar.calendarId, calendarEvent, conference_data_version: 1)

INSERT INTO "events" ("summary", "description", "start", "end", "calendarID", "eventID", "clientID", "managerID", "created_at", "updated_at", "meetCode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
            @eventRecord.clientID= current_user.id
        end

        @eventRecord.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def editEvent
        @event = Event.find(params[:format])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def reviewEvent
        event = params[:event]

        @event = Event.find(event[:eventID])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]
---
    def deleteEvent
        eventToDelete = Event.find(params[:event])

        client = get_google_calendar_client current_user

        if client.delete_event(eventToDelete.calendarID, eventToDelete.eventID)
            Event.delete(eventToDelete.id)