app/controllers/calendar_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def create
        userID = params[:userID]
        cliente = User.find(userID)

SELECT "calendars".* FROM "calendars" WHERE "calendars"."managerId" = ? AND "calendars"."userId" = ? LIMIT ?  [["managerId", "5"], ["userId", "6"], ["LIMIT", 1]]
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 1]]
---
    def delete
        userID = params[:userID]

        client = get_google_calendar_client current_user
        calendar = Calendar.find_by(managerId: current_user.id, userId: userID)

        if calendar
            client.delete_acl(calendar.calendarId, calendar.acl_id)
            client.delete_calendar(calendar.calendarId)

            Calendar.delete(calendar.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def createEventConfirm
        event = params[:event]
        userID = event[:userID]

        client = get_google_calendar_client current_user

        # Da sistemare con tutti i dati
        # @newEvent = Event.new()
        # @newEvent.summary = event[:summary]
        # @newEvent.save

        # Controlla la scelta di creazione della conferenza meet dal form
        if event[:meetConference]
            conferenceData = {
                create_request: {
                   request_id: SecureRandom.uuid
                }
            }
        else
            conferenceData = nil
        end

        attendeeRecord = User.find_by(id: userID)