app/controllers/cliente_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def function
      #client = Google::Apis::YoutubeV3::YouTubeService.new
      #client.authorization = authorize

      client = get_google_youtube_client current_user

      part = 'snippet,contentDetails,statistics'

      @mineresponse= client.list_channels(part, "mine":true).to_json
      item = JSON.parse(@mineresponse).fetch("items")[0]

      channelID= item.fetch("id")

      user = User.find(current_user.id)