app/controllers/cliente_controller.rb

    def search
        @users = User.all
---
SELECT "users".* FROM "users"

    def visualize
        @profilatoId= params[:id]
        @profilato = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def events
        @events=Event.all
---
SELECT "events".* FROM "events"