app/controllers/manager_controller.rb

    def affiliazioni
        @affiliazioni=Affiliation.all
---
SELECT "affiliations".* FROM "affiliations"

    def aziende
        @users=User.all
---
SELECT "users".* FROM "users"

    def singleone
        @cliente= User.find(params[:cliente])
        if !Affiliation.where(manager: current_user.id).where(cliente: @cliente.id).where(status: 'accepted').take
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."manager" = ? AND "affiliations"."cliente" = ? AND "affiliations"."status" = ? LIMIT ?  [["manager", "5"], ["cliente", "6"], ["status", "accepted"], ["LIMIT", 1]]

    def events
        @cliente= User.find(params[:cliente])
        @events=Event.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "events".* FROM "events"