app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @reviewer= current_user.id
    @reviewed= Review.find(params[:id]).reviewed

INSERT INTO "reviews" ("reviewer", "reviewed", "stars", "testo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reviewer", "8"], ["reviewed", "7"], ["stars", 5], ["testo", "Ottimo lavoro !"], ["created_at", "2022-10-31 12:45:06.385949"], ["updated_at", "2022-10-31 12:45:06.385949"]]
---
  def create
    @review = Review.new(review_params)
    @reviewed= review_params[:reviewed]
    respond_to do |format|
      if @review.save

UPDATE "reviews" SET "testo" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["testo", "Ottimo lavoro !!"], ["updated_at", "2022-10-31 12:45:10.581125"], ["id", 1]]
---
  def update
    @reviewed= review_params[:reviewed]
    respond_to do |format|
      if @review.update(review_params)