app/controllers/utility_controller.rb

SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "affiliations".* FROM "affiliations"
SELECT "calendars".* FROM "calendars"
SELECT "events".* FROM "events"
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 2]]
---
    def annulla
        affiliation= Affiliation.find(params[:id])
        @cliente= affiliation.cliente
        @manager= affiliation.manager
        @azienda= affiliation.azienda

        #ELIMINA TUTTE LE AFFILIAZIONI RELATIVE A QUEL MANAGER E A QUEL CLIENTE SE STO ELIMINANDO L'AFFILIAZIONE MANAGER-CLIENTE
        if @azienda==""
            affiliazioni= Affiliation.all
            calendari= Calendar.all
            eventi= Event.all

            affiliazioni.each do |affiliazione_like|
                if (affiliazione_like.cliente==@cliente && affiliazione_like.manager==@manager)
                    affiliazione_like.destroy
                end
            end

            #ELIMINA I LORO CALENDARI DAL DATABASE
            calendari.each do |calendario|
                if (calendario.userId.to_i==@cliente.to_i && calendario.managerId.to_i==@manager.to_i)
                    calendario.destroy
                    redirect_to '/calendar/deleteCalendar?userID='+@cliente and return
                end
            end

            #ELIMINA I LORO EVENTI DAL DATABASE
            eventi.each do |evento|

DELETE FROM "affiliations" WHERE "affiliations"."id" = ?  [["id", 5]]
---

        #ALTRIMENTI ELIMINA SOLO L'AFFILIAZIONE MANAGER-AZIENDA
        else
            affiliation.destroy