app/controllers/utility_controller.rb

DELETE FROM "affiliations" WHERE "affiliations"."id" = ?  [["id", 5]]
---
    def annulla
        affiliation= Affiliation.find(params[:id])
        @cliente= affiliation.cliente
        @manager= affiliation.manager
        @azienda= affiliation.azienda
        affiliation.destroy