app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" ORDER BY created_at DESC
---
  def index
    @videos = Video.order('created_at DESC')

INSERT INTO "videos" ("link", "title", "published_at", "likes", "dislikes", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @video = Video.new(video_params)
    if @video.save