app/controllers/youtube_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "access_token" = ? WHERE "users"."id" = ?
---
  def list
    client = get_google_youtube_client current_user

    part = 'snippet,contentDetails,statistics'

    #@response = client.list_channels(part, "id": ["UC_x5XG1OV2P6uZZ5FSM9Ttw"]).to_json

    #METODO PER OTTENERE IL CANALE RELATIVO AL CLIENTE

    @mineresponse= client.list_channels(part, "mine":true).to_json
    item = JSON.parse(@mineresponse).fetch("items")[0]

    channelID= item.fetch("id")

    user = User.find(current_user.id)
    user.update_attribute(:channelID, channelID)

UPDATE "users" SET "updated_at" = ?, "access_token" = ? WHERE "users"."id" = ?
---
    client.authorization.grant_type = "refresh_token"

    client.authorization.refresh!
    current_user.update_attribute(:access_token, client.authorization.access_token)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def list_subs
    # client = get_google_youtube_client current_user
    # youtube = Google::Apis::YoutubeV3::YouTubeService.new
    # youtube.authorization = authorize

    if current_user.ruolo == "manager"
      cliente = User.find(params[:userID])

UPDATE "users" SET "updated_at" = ?, "access_token" = ? WHERE "users"."id" = ?
---
  def list_vid
    # client = Google::Apis::YoutubeV3::YouTubeService.new
    # client.authorization = authorize

    client = get_google_youtube_client current_user

    maxResult = 50
    @listActivities = client.list_activities("snippet,contentDetails,id", mine: true, max_results: 100)

  rescue Google::Apis::AuthorizationError
    secrets = Google::APIClient::ClientSecrets.new({
        "web" => {
          "access_token" => current_user.access_token,
          "refresh_token" => current_user.refresh_token,
          "client_id" => ENV["GOOGLE_OAUTH_CLIENT_ID"],
          "client_secret" => ENV["GOOGLE_OAUTH_CLIENT_SECRET"]
        }
    })
    client.authorization = secrets.to_authorization
    client.authorization.grant_type = "refresh_token"

    client.authorization.refresh!
    current_user.update_attribute(:access_token, client.authorization.access_token)