app/controllers/yt_menu_controller.rb

  def index
  end

=begin   private
=end
=begin def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]