app/views/reviews/_review.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
                        <span>
                        <% if !User.find(review.reviewer).avatar.attached?%>
                          <img src="<%=withoutLast5(User.find(review.reviewer).avatar_url)%>" alt="avatar"

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
                        <h4 class="text-capitalize">
                            <%= User.find(review.reviewer).full_name%>