app/views/reviews/index.html.erb

    <div>
      <h1 class="text-capitalize">Recensioni di <%= User.find(@recensito).full_name %></h1>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]